{"thread":[{"date":"20140907-00:00:00 -0400","author":"armiegrl","postID":"post_11079684","authorID":"/personal_pages/user/10434099","content":"My husband is in a rehab in Florida,and is moving to a sober living home,also in Florida. We live in Connecticut, my question is What is required and expected in these homes? Also I am trying to be positive and support him in every way, but it's hard when i don't  feel like i'm apart of his life anymore. How do i continue so stay positive and supportive for the next 3 months(,maybe longer depends on how he feels)? Also he has a job here that is paying for all this, and from what I've read about most of these places they want you to get a job, but if that happens he loses hs job here and insurance, is it mandatory or can he volunteer so he doesn't lose those?"},{"date":"20140907-00:00:00 -0400","author":"Jinx_777","replyTo":"/personal_pages/user/10434099","postID":"post_11079856","authorID":"/personal_pages/user/8976007","content":"i really do not understand why he cannot go to a sober living house in connecticut?   a sober living house is where people live after detox.  random UA's, have to get a job, have a curfew, etc.   it makes NO sense that he has to be away from you and his job.  i understand he went to florida for a rehab, but they could refer him to a sober living home where you live.   i would be on the phone with them first thing in the morning. i don't see how him losing his job, possibly his wife is going to help him stay sober??? keep us posted"},{"date":"20140907-00:00:00 -0400","author":"armiegrl","replyTo":"/personal_pages/user/8976007","postID":"post_11079953","authorID":"/personal_pages/user/10434099","content":"He says he feels like if he was to close to home it would make him not want to stay and continue with his sobriety. Its harder for him to walk outside and get on a flight to come home, than to walk outside and call someone he knows. He also said it's his security blanket, and because he already know the dr's counselors. Believe me i have asked all these question, and his therapist and others say you need to be supportive, like i haven't for the last 2 years of this ****. I guess i can understand that in a way but doesn't mean it doesn't hurt. He already tried coming home after the first rehab and do the outpatient way but that didn't last long before he was back to drinking. I'm not worried about him being with someone else or doing something like that to hurt me, it's just the distance. and it's not cheap for him to be there either, or cheap for me to fly there. I think he feels like if he came back to Connecticut right now he would relapse again, and i don't want that."},{"date":"20140908-00:00:00 -0400","author":"atthebeach","postID":"post_11083435","authorID":"/personal_pages/user/1235186","content":"Hun at some point he is going to have to come home. Where someone lives doesn't keep them clean. He has to face reality, confront his demons, And come home. He will have to maintain his sobriety with support, meetings, counselors and a strong desire to want to stay clean. Have you been attending any recovery support for yourself? Counseling, nar-anon, al-anon, celebrate recovery, church? We get just as sick as they are and we also need recovery and healing. There is always hope. Keep the faith. Debbie"},{"date":"20140908-00:00:00 -0400","author":"armiegrl","replyTo":"/personal_pages/user/1235186","postID":"post_11086329","authorID":"/personal_pages/user/10434099","content":"His mother and I have been attending an al-non group, only 2 times so far, i have a therapist i talk to, I have really bad PTSD from being in war, so i just started talking to her about this. I know i have to change as well, if not our relationship will never work. I really am trying to do my part to help in any and every way. I don't want to just give up on him or what we have, especially since he was there for me through 3 tours in Iraq and 1 Afghanistan, each 18 months i was gone. When i came home from my last tour in Iraq I got hurt really bad so was in a hospital for 13 months and he was there for me the whole time, Even when i didn't remember who he even was, so i feel like i have to try everything to support him.    "},{"date":"20140908-00:00:00 -0400","author":"Jinx_777","replyTo":"/personal_pages/user/10434099","postID":"post_11086406","authorID":"/personal_pages/user/8976007","content":"so sorry for all you have been through so all of us can have freedom.  thank you so much for your service. i understand the pros and cons of him coming home for sober living.  you have spent so much time away from him, what is a few more months??? just a blip on the radar. you can use this time to work on you, so you are more able to help him when he comes home.   whatever happens, i am sure it was meant to be.  prayers of healing for you both"},{"date":"20140908-00:00:00 -0400","author":"armiegrl","replyTo":"/personal_pages/user/8976007","postID":"post_11086955","authorID":"/personal_pages/user/10434099","content":"I'm praying for us as well, lately it seems like they are putting **** into his head and his listening. He spent so many years working and prepping for the job of his dreams and now that he's got it, they told him to quit and stay down there. I have noticed with all these rehab's and sober houses the employees are addicts in recovery and they came from other state and never left. I know his emotions are all over the place, but making a big decision like living there, i think would be bad for his recovery impression that family helps with recovery. They actually contacted his job and recommended he not return. where do they get off making those decision. I'm just so confused as you can probably tell."},{"date":"20140908-00:00:00 -0400","author":"atthebeach","postID":"post_11087077","authorID":"/personal_pages/user/1235186","content":"I am so sorry for what you have been through. thank you for your service to our country. i am glad you are seeking therapy. please co to ie with the al-anon meetings they really do help. It is recommended to not make any major decision or change within the year of recovery, ie.. Divorce, change jobs unless of course you had a supplier at your job, relocating. Yes his emotions are all over place. They certainly should t be advising him to relocate and quit his job. Where does that leave you? Praying he listens to his heart."},{"date":"20140908-00:00:00 -0400","author":"armiegrl","replyTo":"/personal_pages/user/1235186","postID":"post_11088042","authorID":"/personal_pages/user/10434099","content":"That's what i thought, but they are asking him to relocate to florida and quit his job. they have also told him to be selfish and not to worry about his family at home. Which i can understand be a little selfish but to not worry about us i don't get. Now he is moving to a sober living house, which we have to pay for. My next group meeting with al non is tomorrow night so i will ask these questions, just worried and confused. I thought these places are suppose to help, all they have done is cause more stress and confusion. I guess paying for a more expensive rehab doesn't make a difference."},{"date":"20140908-00:00:00 -0400","author":"Jinx_777","postID":"post_11088723","authorID":"/personal_pages/user/8976007","content":"unfortunately some of those places are all about the money and not about what is best for the addict.   from everything you have said, i would demand he find a place closer to home so he can work the job he has dreamed of instead of some fast food place in florida. i don't think they have his best interests in mind"}],"title":"advice and info on sober living homes","URL":"http://www.medhelp.org/posts/Addiction-Alcohol-Drug-Rehab/advice-and-info-on-sober-living-homes/show/2298451"}