{"title":"Preventing Panic Attack Diarrhea","thread":[{"content":"Hello, I suffer from the worst symptom anxiety and panic attacks can have: diarrhea. And I mean, EXPLOSIVE diarrhea. When it hits, I have very little time to get to a bathroom. There are a few situations that are known to cause me to have a panic attack. I take half a Xanax as needed (which is not very often) for the general axiety. But it does not stop the diarrhea in the severe panic attacks. There are times when I cannot avoid the situations that typically cause me to have a panic attack. One situation in particular is being stuck in a car in traffic. For me,its a lot like being chlostrophobic and stuck in a confined place. My panic is caused by the possibility I'll have a panic attack (with explosive diarrhea) and there is no possible way I will make it to a bathroom, because there's no place to turn off and get out of the traffic. I have had messed myself on a few occasions and had to go home to clean up and clean my car. Over labor day weekend I would like to take a trip in the car with 3 girlfriends. I think its a 6 hour drive to and from our destination. I don't want to have to cancel due to the possibility I'll have a panic attack and have diarrhea while we're sitting in labor day traffic. I would like to know if there are any medications I could ask my doctor to prescribe that I could take before I go on this trip that would essentially stop all movement in my bowels on the days we'll be driving. I am truly desperate. My only alternative is to do very unhealthy things such as use the bowel cleansing product I had to use the night before my laparscopic hysterectomy surgery (can't remember the name but it was an over the counter product) and then starve myself and not eat or drink anything, and pump myself full of the Xanax for the drives. I'm just hoping there might be a medication available that might be a little safer approach. Thanks, Valerie","author":"horse_mom1","postID":"/3/anxiety-and-panic-disorders-exchange/forum/2658","date":"20090718-18:24:21 -0400","authorID":"horse_mom1"},{"content":"I don't know of any medication that would do what you want and, if there were, I'd think it could be dangerous. The best thing to do would be to begin to help yourself learn to turn off those thoughts about having an attack which bring one on. Also, six hours in a car sounds like there are going to be a few stops along the way. Ever try relaxation breathing to help stop the thoughts? You might give it a try. I have it on my Self-help page on my website.","author":"Dr_Patricia_Farrell","postID":"/3/anxiety-and-panic-disorders-exchange/forum/2658/0","date":"20090718-18:47:59 -0400","authorID":"Dr_Patricia_Farrell"},{"content":"Thank you for the suggestion. Unfortunately, I have tried all kinds of techniques to avert the panic attack, deep controlled breathing, relaxation, visualization, singing, you name it, I've tried it. Unfortunately, there is no amount of thought control that can stop the physiological response once it has started. I just can not talk, think, or breathe my way out of having diarrhea. My mind is unable to control my bowels. And I have had no luck trying to prevent the diarrhea by using these techniques even when I start them way before I'm in the situation. The diarrhea just has a mind of its own. I keep thinking there must be some medication available, for instance something for irritable bowel syndrome or something like that, that could help me during this trip. Otherwise, I'm going to have to cancel the trip.","author":"horse_mom1","postID":"/3/anxiety-and-panic-disorders-exchange/forum/2658/1","date":"20090718-19:07:10 -0400","authorID":"horse_mom1"},{"content":"Don't cancel the trip before you talk to your doc about this. Perhaps there is something you can take to quiet this activity enough to allow you to be comfortable on the trip.","author":"Dr_Patricia_Farrell","postID":"/3/anxiety-and-panic-disorders-exchange/forum/2658/2","date":"20090718-19:31:11 -0400","authorID":"Dr_Patricia_Farrell"},{"content":"Ahh Valerie. How wonderful to find someone who experiences the same things I do. Well not wonderful for either of us going through the nightmare, but so nice to know I'm not alone. I have almost exactly the same thing with the diarrohea. And mostly it is in the car. And yes there have been several occassions that I have had no choice but to make a mess - once was even in the middle of a shopping centre (without the security of my car ). It doesn't get much more humliating than that, I have had panic attacks for years and they were relatively well controlled with Aropax/Paxil for about 6 years, until the first diarrohea episode in the shopping centre. It was just before I got married & so I guess my body was under a lot more stress than normal, but it was so insane that I figured it must have been food poisoning. Then a few months later...the car....all of a sudden,,,no warning...& not the slightest thing you can do about it. Since then and over the last couple of years I have had about 4 further episodes. It's a horrible vicious cycle, How can your mind control your body to that degree?? It's just crazy. And I too have tried everything...you made me laugh...yes the singing, breathing, meditation, calming mouth sprays, nup...none of it works when you get \"the feeling\"...by then it's all over! Well I'm back on the Aropax/Paxil but it is not really doing the trick (and has nasty side-effects on my sex life....which is the last thing I need in the circumstances!). So I am just in process of changing to Lexapro, plus I always carry benzos with me for particularly bad times...& of course always a pack of immodium. Nothing can stop the initial 'explosion' but at least blocking me up afterwards means I can do my best to carry on with my day. (Oh and carrying a spare pair of knickers in your handbag is never a bad idea either!) Thank god I have recently met a boyfriend that is incredibly understanding & helpful with this. It's far from romantic going for a Sunday drive & telling him I have to rapidly pull over whilst I crap myself! (Thankfully he is ex Forces so has seen a helluvalot worse). I don't know about you, but even the doctors and psychologists have said this is very unusual, so it really is a relief to find a fellow sufferer. God if anyone is out there that can help, please please do. (I'm also having a colonoscopy soon to confirm there is nothing more serious going on (or should I say physically visible in a medical sense). I think I know in my heart that it is due to the anxiety and panics though. Well Valerie, we are both looking for an answer, but I have a nasty feeling that to get this reaction to the extent we do is quite rare & so not very well-known &/or researched. Until something better comes along I reckon you have no choice but to dope yourself up on xanax and take a couple of immodium to help block you up. And I don't know how much of an effect it has, but don't eat any fatty foods or drink much alcohol as in my experience these things seem to make it worse. And don't forget your spare knickers!!!! Good luck & it would be great to stay in touch. Amanda xx","author":"AmandaInAus","postID":"/3/anxiety-and-panic-disorders-exchange/forum/2658/3","date":"20090818-00:04:09 -0400","authorID":"AmandaInAus"},{"content":"I have had anxiety related diarrhea as far back as I can remember. I can remember having to rush to the bathroom in middle school, and mornings before school were bad too. As an adult it has caused problems at work more than a few times, it's not always easy to stop what you're doing to go to the bathroom. It also happens when I'm out shopping, and for some reason it loves to happen at Wal-Mart where the bathrooms are always occupied . It's very strange because I don't get the racing heart or fast breathing like a typical panic attack, just a flush/hot feeling which usually comes first before the stomach cramping. Another bad thing is I feel like the older I get the less I can control it, when I was younger I could easily hold it until I found a suitable restroom (I hate public restrooms), but now I feel like I better find a restroom NOW. The only thing I have found to help is Immodium, if I have a long trip coming up or if I'm going somewhere that makes me nervous I will take two caplets about an hour ahead of time and it seems to help.","author":"gulfcoastdude30","postID":"/3/anxiety-and-panic-disorders-exchange/forum/2658/4","date":"20090920-13:39:46 -0400","authorID":"gulfcoastdude30"},{"content":"What I do is drink gingerale and suck on ice and eat things like apple sauce and drink powerade .But some days I do a liquid diet instead of eating.Drinking water also helps and stop eating greasy foods and just eat things like salad without salad dressing.","author":"coko26","postID":"/3/anxiety-and-panic-disorders-exchange/forum/2658/5","date":"20090920-23:07:19 -0400","authorID":"coko26"},{"content":"I have the same problem. I take Levbid. Its an antispasmodic. I usually get massive cramping before the diarrhea. When I get anxious I still have to go to the bathroom. The levbid just buys me some more time.","author":"dbird02","postID":"/3/anxiety-and-panic-disorders-exchange/forum/2658/6","date":"20090925-21:32:43 -0400","authorID":"dbird02"},{"content":"Hello... I just want all of you girls to know that you're NOT ALONE! My name is Jess, and I have had anxiety and depression problems since i was in 5th grade. I graduated 2 years ago. My anxiety and depression got so bad that I didn't even want to go to school. I'm very fortunate for the help I got through my school and my family. I see a pshycitrist (Spelling) and he helps me a lot. I have a really really bad problem. Normally when im around a lot of people and the room is silent, i get super nervous and have a panick attack. Suddenly come the sharp killer pains in the stomach, and i run off to the bathroom and blow up. I first started on Zoloft (WORST MED. EVER) Made me think of suiside, and i changed it immidately. Next i went on lexapro. Very good medicine, it just wasn't strong enough for me. Now I am on Effexor XR.. best medicine i've ever been on. Now I'm not 100 % cured, but i just want to let you ladies know that there is HOPE out there for you. I have tried the whole 'calm down jess, just relax you'll be fine' but it almost seems like it makes things worse. My biggest issue right now is going to college. I have been out of highschool now for about 2 years, thank god i graduated. But seriously my parents dont believe in medication and they think that i should just get over it and deal with my problems.. well sometimes it's just not that EASY! I'm a 20 year old girl with hopes and dreams of becoming a dental hygienist. Now how am I to go to school and get a degree whenever I can not stand being around a lot of people in a small room? Now if i'm just one on one, or just a few people around i am completely fine. It just freaks me out when im in a classroom because i feel trapped. When I went for orientation, the girl beside me was taking notes and they were already talking about mid terms, and finals. I got the complete URGE of stabbing in the stomach, and ran to the bathroom and stayed in there through the rest of orientation. I let my parents down, and myself. I just wish that someone could come up with something to cure this issue we have. I honestly thought I was all alone, until i finally googled it, and now i realized im not alone. If either of you would like to chat, my email is jessthebestx@hotmail.com I normally check my email daily, and it would be great to talk to some people with the same problems i have, because I use to feel all alone. Thank you and there are some meds that will *help* with the anxiety, but you just need to relax, and we all just need to hang in there and work together!!","author":"jessicaxx914","postID":"/3/anxiety-and-panic-disorders-exchange/forum/2658/7","date":"20091115-02:58:43 -0500","authorID":"jessicaxx914"},{"content":"Dr Pat I am also wondering if you know of any actual breathing techniques that are helpful or web sites that may offer some ideas. I am also having a similar issue myself. I have always been told to do them but it seems that the people that tell me this don't offer anything on how to do them. The only one that I know of is in through the mouth and out through the nose which really only helps a little bit. I wish there was more info on techniques available as they can be helpful I know. Thanks.","author":"sandeestreasures","postID":"/3/anxiety-and-panic-disorders-exchange/forum/2658/8","date":"20091117-13:26:58 -0500","authorID":"sandeestreasures"},{"content":"Dear sandeestreasures, Here's a link to Dr. Farrell's Self-Help page, including Relaxation Breathing, Guided Imagery, and links to other self-help resources. Yours in health, Byroney","author":"Byroney_WebMD_Staff","postID":"/3/anxiety-and-panic-disorders-exchange/forum/2658/9","date":"20091117-19:01:22 -0500","authorID":"Byroney_WebMD_Staff"},{"content":"Thanks so much for the link Byroney. Honestly the one thing I have learned about my own anxieties and mental health is resources are invaluable. I bookmarked the page for when I need to take time to breathe (literally). Great link indeed. Thank you again.","author":"sandeestreasures","postID":"/3/anxiety-and-panic-disorders-exchange/forum/2658/10","date":"20091117-23:39:31 -0500","authorID":"sandeestreasures"},{"content":"I am also readying a downloadable video on relaxation breathing that I will be offering through Amazon around the beginning of December. You might want to watch for it. The name will be something like Dr. Farrell's Relaxation Breathing.","author":"Dr_Patricia_Farrell","postID":"/3/anxiety-and-panic-disorders-exchange/forum/2658/11","date":"20091118-08:19:31 -0500","authorID":"Dr_Patricia_Farrell"},{"content":"Hi Valerie, You are not alone, after suffering the same panic attacks as you have for many many many years I finally at the age of 28 decided to research today and came across your post. I am married now, and going to twice the amount of family functions, it has become embarrassingly unmanageable for me. I am such a happy, bubbly person (with people and places I am comfortable with), many people find it hard to believe I have such an issue. I looked up Crohn's disease, Ulcerative colitis and more . My husbad thought I would have those kinds of diseases/disorders, however, I think my issues are more emotional such as anxiety. I am very anxious to find ways to get rid of these God awful thoughts. Meetings are horrible for me. I have a job I love, great position, great money, however, I cannot handle the meetings. The minute I find out I have a meeting I immediately start to panic and make sure I eat healthy, not eat or drink anything that may cause diarrhea. I go through depression, sometimes very edgy because all I think about 24/7 is that meeting, which may be one week away. I don't enjoy anything for a whole week because thoughts of \"what if I have to go to the bathroom\" consume me. I am not myself at those times. Meeting day I go to the bathroom numerous times to ensure I don't have to go when we are in the meeting, but of course the second the door closes behind me and the meeting starts I need to go the bathroom. The smaller the room the worst my thoughts get \" what if I pass gas, what if I have to go?\" all these \"what if's\" have left me so depressed. And let me tell you once the meeting is over with I feel like a weight has been lifted off my shoulders, and all of a sudden I am sooooooo happy. I also go through the same feelings in traffic, or taking a shuttle, or a bus to somewhere. Standing in lines, waiting in waiting rooms. I find myself scouting for bathrooms everywhere I go, just incase I have to go. If I don't find a bathroom or if the bathroom is too close to where people may hear me, my thoughts get worse, and the thing I don't want to happen actually happens (the need to go to the bathroom badly). Anyways, I am going to do more research, please keep me updated on anything you find, I will do the same, or if you need to talk to anyone please let me know.","author":"Monster28","postID":"/3/anxiety-and-panic-disorders-exchange/forum/2658/12","date":"20100103-20:41:04 -0500","authorID":"Monster28"},{"content":"Hi Amanda, I have the same issues, I got a colonoscopy a few years back but just like you deep down inside I knew they were anxiety and panic attacks.","author":"Monster28","postID":"/3/anxiety-and-panic-disorders-exchange/forum/2658/13","date":"20100103-20:47:19 -0500","authorID":"Monster28"}],"URL":"/3/anxiety-and-panic-disorders-exchange/forum/2658"}